In [23]:
import pandas as pd
import numpy as np

In [24]:
sozluk1 = {"İsim":["Ahmet","Mehmet","Zeynep","Atıl"],"Spor":["Koşu","Yüzme","Koşu","Basketbol"],"Kalori" : [100,200,300,400]}

In [25]:
dataFrame1 = pd.DataFrame(sozluk1, index=[0,1,2,3])

In [26]:
dataFrame1

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [27]:
sozluk2 = {"İsim":["Osman","Fatma","Furkan","Murat"],"Spor":["Koşu","Yüzme","Koşu","Basketbol"],"Kalori" : [150,200,175,250]}

In [28]:
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [29]:
dataFrame2

     İsim       Spor  Kalori
4   Osman       Koşu     150
5   Fatma      Yüzme     200
6  Furkan       Koşu     175
7   Murat  Basketbol     250

In [30]:
sozluk3 = {"İsim":["Hatice","Nur","Hacer","Lale"],"Spor":["Koşu","Basketbol","Futbol","Basketbol"],"Kalori" : [150,200,175,250]}

In [32]:
dataFrame3 = pd.DataFrame(sozluk3, index=[8,9,10,11])

In [33]:
dataFrame3

      İsim       Spor  Kalori
8   Hatice       Koşu     150
9      Nur  Basketbol     200
10   Hacer     Futbol     175
11    Lale  Basketbol     250

# concatenation

In [37]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      İsim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     150
5    Fatma      Yüzme     200
6   Furkan       Koşu     175
7    Murat  Basketbol     250
8   Hatice       Koşu     150
9      Nur  Basketbol     200
10   Hacer     Futbol     175
11    Lale  Basketbol     250

# merge

In [38]:
mergeSozluk1 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atıl"],"Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [39]:
mergaDataFrame1 = pd.DataFrame(mergeSozluk1)

In [40]:
mergaDataFrame1

     İsim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [41]:
mergeSozluk2 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atıl"],"Kalori" : [100,200,250,150]}

In [42]:
mergaDataFrame2 = pd.DataFrame(mergeSozluk2)

In [43]:
mergaDataFrame2

     İsim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     250
3    Atıl     150

In [44]:
pd.merge(mergaDataFrame1,mergaDataFrame2,on="İsim")

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     250
3    Atıl  Basketbol     150

In [45]:
maasSozluk = {"İsimler":["Burak","Ahmet","Mehmet","Cuma"],
             "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maaş":[200,300,400,500]}

In [46]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [53]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [54]:
maasDataFrame["Departman"].nunique()

3

In [56]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [60]:
def bruttenNete(maas):
    return maas*0.66

In [62]:
maasDataFrame["Maaş"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maaş, dtype: float64

In [63]:
maasDataFrame.isnull()

   İsimler  Departman   Maaş
0    False      False  False
1    False      False  False
2    False      False  False
3    False      False  False

In [64]:
yeniBirVeri = {"Karakter":["South Park","South Park","Simpson","Simpson"],
              "Karakter İsmi":["Cartman","Kenny","Homer","Bart"],
              "Karakter Yaş":[9,12,23,12]}

In [65]:
karakterDataFrame = pd.DataFrame(yeniBirVeri)

In [66]:
karakterDataFrame

     Karakter Karakter İsmi  Karakter Yaş
0  South Park       Cartman             9
1  South Park         Kenny            12
2     Simpson         Homer            23
3     Simpson          Bart            12

In [71]:
karakterDataFrame.pivot_table(values = "Karakter Yaş",
                              index=["Karakter","Karakter İsmi"],
                             aggfunc=np.sum)

                          Karakter Yaş
Karakter   Karakter İsmi
Simpson    Bart                     12
           Homer                    23
South Park Cartman                   9
           Kenny                    12